IDEA StatiCa Open Model
ReinfBarOnEdge.BarDistance Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D BarDistance { get; set; }
Public Property BarDistance As Vector3D
	Get
	Set
public:
property Vector3D^ BarDistance {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace